In [1]:
import sqlite3
import pandas as pd
import numpy as np

Data was taken from https://www.w3resource.com/sql-exercises/soccer-database-exercise/soccer_team_view_data.php and https://www.w3resource.com/sql-exercises/soccer-database-exercise/index.php

# Load data into pandas

In [5]:
soccer_team = pd.read_csv('/Users/dariga_kokenova/Documents_comp/Flatiron/blogs/blog_june_01/soccer_team.csv', 
                          header = 0)

In [7]:
soccer_team.head()

,team_id,team_group,match_played,won,draw,lost,goal_for,goal_agnst,goal_diff,points,group_position
0,1201,A,3,1,0,2,1,3,-2,3,3
1,1202,F,3,0,1,2,1,4,-3,1,4
2,1203,E,3,2,0,1,4,2,2,6,2
3,1204,D,3,2,1,0,5,3,2,7,1
4,1205,D,3,0,1,2,2,5,-3,1,4

In [24]:
soccer_team.columns

Index(['team_id', 'team_group', 'match_played', 'won', 'draw', 'lost',
       'goal_for', 'goal_agnst', 'goal_diff', 'points', 'group_position'],
      dtype='object')

In [22]:
soccer_country = pd.read_csv('/Users/dariga_kokenova/Documents_comp/Flatiron/blogs/blog_june_01/soccer_country.csv', 
                          header = 0, usecols = ['country_id','country_abbr','country_name'])

In [23]:
soccer_country.head()

   country_id country_abbr    country_name
0        1201          ALB         Albania
1        1202          AUT         Austria
2        1203          BEL         Belgium
3        1204          CRO         Croatia
4        1205          CZE  Czech Republic

In [25]:
soccer_country.columns

Index(['country_id', 'country_abbr', 'country_name'], dtype='object')

# Create SQL database

In [2]:
## Create new SQL database
conn = sqlite3.connect('soccer')
cur = conn.cursor()

conn.commit()

In [26]:
# Create SQL table called "soccer_team" 
cur.execute("""CREATE TABLE soccer_team (
                                team_id TEXT PRIMARY KEY NOT NULL,
                                team_group NOT NULL,
                                match_played NOT NULL,
                                won NOT NULL,
                                draw NOT NULL,
                                lost NOT NULL,
                                goal_for NOT NULL,
                                goal_agnst NOT NULL,
                                goal_diff NOT NULL,
                                points NOT NULL,
                                group_position NOT NULL)
            """)
conn.commit()

In [27]:
# Create SQL table called "soccer_country" 
cur.execute("""CREATE TABLE soccer_country (
                                country_id  TEXT PRIMARY KEY NOT NULL,
                                country_abbr TEXT,
                                country_name TEXT)
            """)
conn.commit()

# Pull data into SQL

In [34]:
for index, row in soccer_team.iterrows():
    cur.execute("""INSERT INTO soccer_team (team_id, team_group, match_played, won, draw, lost,
                    goal_for, goal_agnst, goal_diff, points, group_position) 
                    values(?,?,?,?,?,?,?,?,?,?,?)""", 
                    row)
conn.commit()

In [35]:
for index, row in soccer_country.iterrows():
    cur.execute("""INSERT INTO soccer_country (country_id, country_abbr, country_name) 
                    values(?,?,?)""", 
                    row)
conn.commit()

# Pull in data into the python environment

In [38]:
cur.execute("SELECT * from soccer_team")
soccer_team_data = pd.DataFrame(cur.fetchall())
soccer_team_data.columns = [x[0] for x in cur.description]
soccer_team_data

,team_id,team_group,match_played,won,draw,lost,goal_for,goal_agnst,goal_diff,points,group_position
0,1201,A,3,1,0,2,1,3,-2,3,3
1,1202,F,3,0,1,2,1,4,-3,1,4
2,1203,E,3,2,0,1,4,2,2,6,2
3,1204,D,3,2,1,0,5,3,2,7,1
4,1205,D,3,0,1,2,2,5,-3,1,4
5,1206,B,3,1,2,0,3,2,1,5,2
6,1207,A,3,2,1,0,4,1,3,7,1
7,1208,C,3,2,1,0,3,0,3,7,1
8,1209,F,3,1,2,0,6,4,2,5,1
9,1210,F,3,1,2,0,4,3,1,5,2
10,1211,E,3,2,0,1,3,1,2,6,1
11,1212,C,3,1,0,2,2,2,0,3,3
12,1213,C,3,2,1,0,2,0,2,7,2
13,1214,F,3,0,3,0,4,4,0,3,3
14,1215,E,3,1,1,1,2,4,-2,4,3
15,1216,A,3,0,1,2,2,4,-2,1,4
16,1217,B,3,0,1,2,2,6,-4,1,4
17,1218,B,3,1,1,1,3,3,0,4,3
18,1219,D,3,2,0,1,5,2,3,6,2
19,1220,E,3,0,1,2,1,3,-2,1,4
20,1221,A,3,1,2,0,2,1,1,5,2
21,1222,D,3,1,0,2,2,4,-2,3,3
22,1223,C,3,0,0,3,0,5,-5,0,4
23,1224,B,3,2,0,1,6,3,3,6,1

In [39]:
cur.execute("SELECT * from soccer_country")
soccer_country_data = pd.DataFrame(cur.fetchall())
soccer_country_data.columns = [x[0] for x in cur.description]
soccer_country_data

   country_id country_abbr         country_name
0        1201          ALB              Albania
1        1202          AUT              Austria
2        1203          BEL              Belgium
3        1204          CRO              Croatia
4        1205          CZE       Czech Republic
5        1206          ENG              England
6        1207          FRA               France
7        1208          GER              Germany
8        1209          HUN              Hungary
9        1210          ISL              Iceland
10       1211          ITA                Italy
11       1212          NIR     Northern Ireland
12       1213          POL               Poland
13       1214          POR             Portugal
14       1215          IRL  Republic of Ireland
15       1216          ROU              Romania
16       1217          RUS               Russia
17       1218          SVK             Slovakia
18       1219          ESP                Spain
19       1220          SWE               Sweden
20       1221          SUI          Switzerland
21       1222          TUR               Turkey
22       1223          UKR              Ukraine
23       1224          WAL                Wales
24       1225          SLO             Slovenia
25       1226          NED          Netherlands
26       1227          SRB               Serbia
27       1228          SCO             Scotland
28       1229          NOR               Norway

# SQL test queries (part 1)

In [41]:
cur.execute("""
            SELECT COUNT(*) 
            FROM soccer_team
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

   COUNT(*)
0        24

In [42]:
cur.execute("""
            SELECT * 
            FROM soccer_team
            WHERE team_group = 'A'  AND (won > 0 OR draw > 1)
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

,team_id,team_group,match_played,won,draw,lost,goal_for,goal_agnst,goal_diff,points,group_position
0,1201,A,3,1,0,2,1,3,-2,3,3
1,1207,A,3,2,1,0,4,1,3,7,1
2,1221,A,3,1,2,0,2,1,1,5,2

In [51]:
cur.execute("""
            SELECT DISTINCT team_group 
            FROM soccer_team
            ORDER BY team_group
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

  team_group
0          A
1          B
2          C
3          D
4          E
5          F

In [46]:
cur.execute("""
            SELECT team_group, won, draw, lost
            FROM soccer_team
            WHERE won > 0 OR draw > 1
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

   team_group  won  draw  lost
0           A    1     0     2
1           E    2     0     1
2           D    2     1     0
3           B    1     2     0
4           A    2     1     0
5           C    2     1     0
6           F    1     2     0
7           F    1     2     0
8           E    2     0     1
9           C    1     0     2
10          C    2     1     0
11          F    0     3     0
12          E    1     1     1
13          B    1     1     1
14          D    2     0     1
15          A    1     2     0
16          D    1     0     2
17          B    2     0     1

In [45]:
cur.execute("""
            SELECT team_group, won, draw, lost
            FROM soccer_team
            WHERE won > 0 OR draw > 1
            GROUP BY team_group
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

  team_group  won  draw  lost
0          A    1     0     2
1          B    1     2     0
2          C    2     1     0
3          D    2     1     0
4          E    2     0     1
5          F    1     2     0

In [58]:
cur.execute("""
            SELECT team_group, SUM(won), SUM(draw), SUM(lost)
            FROM soccer_team
            WHERE won > 0 OR draw > 1
            GROUP BY team_group
            ORDER BY SUM(won) DESC
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

  team_group  SUM(won)  SUM(draw)  SUM(lost)
0          E         5          1          3
1          D         5          1          3
2          C         5          2          2
3          B         4          3          2
4          A         4          3          2
5          F         2          7          0

In [59]:
cur.execute("""
            SELECT team_group, SUM(won), SUM(draw), SUM(lost)
            FROM soccer_team
            WHERE won > 0 OR draw > 1
            GROUP BY team_group
            HAVING SUM(won) > 3
            ORDER BY SUM(won) DESC
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

  team_group  SUM(won)  SUM(draw)  SUM(lost)
0          E         5          1          3
1          D         5          1          3
2          C         5          2          2
3          B         4          3          2
4          A         4          3          2

In [66]:
cur.execute("""
            SELECT team_group, SUM(won), SUM(draw), SUM(lost)
            FROM soccer_team
            WHERE won > 0 OR draw > 1
            GROUP BY team_group
            HAVING SUM(won) > 3
            ORDER BY SUM(won) DESC, SUM(draw) DESC
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

  team_group  SUM(won)  SUM(draw)  SUM(lost)
0          C         5          2          2
1          D         5          1          3
2          E         5          1          3
3          A         4          3          2
4          B         4          3          2

In [69]:
cur.execute("""
            SELECT team_group, SUM(won), SUM(draw), SUM(lost)
            FROM soccer_team
            WHERE won > 0 OR draw > 1
            GROUP BY team_group
            HAVING SUM(won) > 3
            ORDER BY SUM(won) DESC, SUM(draw) DESC
            LIMIT 3
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

  team_group  SUM(won)  SUM(draw)  SUM(lost)
0          C         5          2          2
1          D         5          1          3
2          E         5          1          3